n = int(input())
# d[i][0] : i번째 줄에 배치 x
# d[i][1] : i번째 줄 왼쪽에 배치
# d[i][2] : i번째 줄 오른쪽에 배치

# d[i][0] = d[i - 1][0] + d[i - 1][1] + d[i - 1][2]
# d[i][1] = d[i - 1][0] + d[i - 1][2]
# d[i][2] = d[i - 1][0] + d[i - 1][1]
d = [[0] * 3 for _ in range(n)]

d[0][0] = 1
d[0][1] = 1
d[0][2] = 1

for i in range(1, n):
    d[i][0] = (d[i - 1][0] + d[i - 1][1] + d[i - 1][2]) % 9901
    d[i][1] = (d[i - 1][0] + d[i - 1][2]) % 9901
    d[i][2] = (d[i - 1][0] + d[i - 1][1]) % 9901

print(sum(d[n - 1]) % 9901)