t = int(input())
# d[i][j] : i를 1, 2, 3의 합으로 나타내는 방법의 수, 마지막에 사용한 수는 j
# d[i][1] = d[i - 1][2] + d[i - 1][3]
# d[i][2] = d[i - 2][1] + d[i - 2][3]
# d[i][3] = d[i - 3][2] + d[i - 3][1]
# ans = d[i][1] + d[i][2] + d[i][3]
d = [[0] * 4 for _ in range(100001)]

for i in range(1, 100001):
    if i - 1 >= 0:
        d[i][1] = d[i - 1][2] + d[i - 1][3]
        # i가 1이면 1가지
        if i == 1:
            d[i][1] = 1
    if i - 2 >= 0:
        d[i][2] = d[i - 2][1] + d[i - 2][3]
        # i가 2이면 1가지
        if i == 2:
            d[i][2] = 1
    if i - 3 >= 0:
        d[i][3] = d[i - 3][2] + d[i - 3][1]
        # i가 3이면 1가지
        if i == 3:
            d[i][3] = 1

    d[i][1] %= 1000000009
    d[i][2] %= 1000000009
    d[i][3] %= 1000000009

for _ in range(t):
    n = int(input())
    print(sum(d[n]) % 1000000009)